## 2. Pandas

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\jaese\appdata\local\programs\python\python310\lib\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\jaese\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\jaese\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jaese\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: tzdata>=2022.7 in c:\users\jaese\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\jaese\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

C:\Users\jaese\AppData\Local\Temp\ipykernel_13232\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
data = ['a', 'b', 'c', 'd', 'e']

se = pd.Series(data)

type(se)
se.index
se.values

se[0:3]

se.name = 'alphabet'
se.index.name = 'index'
print(se)

index
0    a
1    b
2    c
3    d
4    e
Name: alphabet, dtype: object

In [5]:
data = {'country' : ['kor', 'usa', 'chn', 'jpn'],
        'rank' : [1,2,3,4],
        'grade' : ['A', 'B', 'C', 'D']}

df = pd.DataFrame(data) # csv to json, json to csv, xlsx
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2     chn     3     C
3     jpn     4     D

In [8]:
df.grade

df[['country', 'grade']]

  country grade
0     kor     A
1     usa     B
2     chn     C
3     jpn     D

In [9]:
df.loc[:, ['grade', 'country']]

  grade country
0     A     kor
1     B     usa
2     C     chn
3     D     jpn

In [10]:
df.drop([3], inplace=True)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2     chn     3     C

In [11]:
df = df.drop('rank', axis=1)
df

  country grade
0     kor     A
1     usa     B
2     chn     C

In [12]:
df['rank'] = [1,2,3]
df

  country grade  rank
0     kor     A     1
1     usa     B     2
2     chn     C     3

In [13]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  3 non-null      object
 1   grade    3 non-null      object
 2   rank     3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

       rank
count   3.0
mean    2.0
std     1.0
min     1.0
25%     1.5
50%     2.0
75%     2.5
max     3.0

In [14]:
df['new_rank'] = [10, 100, 30]

df.sort_values(by='new_rank', ascending=False)

  country grade  rank  new_rank
1     usa     B     2       100
2     chn     C     3        30
0     kor     A     1        10

In [16]:
import numpy as np

In [20]:

df['grade'] = np.nan
df.fillna(value='pass', inplace=True)
df

C:\Users\jaese\AppData\Local\Temp\ipykernel_13232\443929249.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'pass' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna(value='pass', inplace=True)

  country grade  rank  new_rank
0     kor  pass     1        10
1     usa  pass     2       100
2     chn  pass     3        30

In [24]:
df.loc[1, 'grade'] = np.nan

In [25]:
df.dropna(how='any')

  country grade  rank  new_rank
0     kor  pass     1        10
2     chn  pass     3        30

In [26]:
json_data = {
    "columns": ["Movie", "Release Year", "Audience", "Rating"],
    "index": [0, 1, 2, 3, 4, 5, 6, 7],
    "data": [
    ["Avengers", 2012, 1500, 8.8],
    ["Interstellar", 2014, 1100, 9.1],
    ["Frozen", 2013, 1020, 8.5],
    ["About Time", 2013, 950, 8.7],
    ["The Dark Knight", 2008, 1300, 9.0],
    ["Inception", 2010, 1200, 8.8],
    ["La La Land", 2016, 800, 8.6],
    ["Toy Story", 2010, 980, 8.5]
    ]
}

df = pd.DataFrame(json_data['data'], columns=json_data['columns'])
df

             Movie  Release Year  Audience  Rating
0         Avengers          2012      1500     8.8
1     Interstellar          2014      1100     9.1
2           Frozen          2013      1020     8.5
3       About Time          2013       950     8.7
4  The Dark Knight          2008      1300     9.0
5        Inception          2010      1200     8.8
6       La La Land          2016       800     8.6
7        Toy Story          2010       980     8.5

In [27]:
df.Movie

0           Avengers
1       Interstellar
2             Frozen
3         About Time
4    The Dark Knight
5          Inception
6         La La Land
7          Toy Story
Name: Movie, dtype: object

In [28]:
df[['Movie', 'Rating']]

             Movie  Rating
0         Avengers     8.8
1     Interstellar     9.1
2           Frozen     8.5
3       About Time     8.7
4  The Dark Knight     9.0
5        Inception     8.8
6       La La Land     8.6
7        Toy Story     8.5

In [29]:
df[df['Release Year'] > 2013] [['Movie', 'Rating']]

          Movie  Rating
1  Interstellar     9.1
6    La La Land     8.6

In [30]:
df['Recommend'] = (df['Audience'] * df['Rating']) // 100
df.sort_values(by='Recommend', ascending=False).head(5)

             Movie  Release Year  Audience  Rating  Recommend
0         Avengers          2012      1500     8.8      132.0
4  The Dark Knight          2008      1300     9.0      117.0
5        Inception          2010      1200     8.8      105.0
1     Interstellar          2014      1100     9.1      100.0
2           Frozen          2013      1020     8.5       86.0